---
kind: method
id: M:Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.GetLevelIdsInRange
source: html/cc6beeb3-928d-4220-7b5f-a3f1b14c344c.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.GetLevelIdsInRange Method

Returns level ids between the top level and the bottom level (including the top level and the bottom level) of
 the area based load boundary line.

## Syntax (C#)
```csharp
public ISet<ElementId> GetLevelIdsInRange()
```

## Returns
The level ids between the top level and the bottom level (including the top level and the bottom level).